{
  "@context": "https://schema.org/",
  "@type": "JobPosting",
  "title": "Actuarial Analyst, Associate Solutions Engineer",
  "description": "<div><div><h1><strong>About hyperexponential (hx)</strong></h1><p>At hyperexponential, we’re building the AI-powered platform that enables the world’s most critical decisions in a $7 trillion industry - which risks to take, and how to price them. These are the decisions that shape real-world outcomes: whether rockets successfully launch into space, autonomous vehicles make it to market, or communities recover after major storms.</p><p>Until now, insurance has been making billion-dollar decisions using outdated tools. We’re changing that. Our platform brings together data, AI, and human expertise to give insurers the fastest path from submission to decision - helping them move faster, act smarter, and take on more risk with confidence.</p><p>Backed by a16z, Highland Europe, and Battery Ventures, we’re scaling globally - already trusted by nearly 50 of the world’s largest insurers, with zero churn and billions in premiums flowing through hx.</p><p>What began as a single product in one market has rapidly evolved into a multi-product, multi-territory platform powering every stage of pricing and underwriting. AI is at the core of what we do - from building the world’s first domain-specific AI peer programmer for insurance (think GitHub Copilot with a PhD in actuarial science) to shaping agentic workflows that reinvent how this industry operates.</p><p>What makes hx different is the people who build it. Here, impact isn’t tied to title or tenure; it’s defined by the challenges you take on and the discipline you bring. Surrounded by peers who stretch you, you’ll do the best, hardest work of your life in a company engineered to endure.</p><p>If that sounds like you, join us in building what comes next.</p><h1><strong>About the Solutions Engineering team</strong></h1><p>Solutions Engineering at hx is the technical heart of our go-to-market organisation. This team is responsible for the <strong>Technical Win</strong> - convincing underwriters, actuaries, IT leaders, and security teams that hx is the platform they can trust with the pricing and underwriting decisions that define their business.</p><p>Our Solution Engineers sit at the edge of what’s possible for our product, our customers, and our industry. This is a small, senior team working on the hardest and most interesting problems hx encounters - where only a combination of technical depth, market expertise, and Renew knowledge will do.</p><p>As a Solutions Engineer, you are often one of the first hxers a prospect meets. Every engagement is high-stakes. Every interaction is visible. You help customers reimagine how pricing and underwriting can work, turning bold ideas and messy legacy realities into practical, production-ready solutions that actually ship. You leave a trace that shapes how customers see the entire company.</p><h1><strong>What you’ll be doing</strong></h1><ul><li><p>Own the <strong>technical sales motion</strong> for complex opportunities, driving the technical win across discovery, demos, proofs of value, and technical evaluations - leveraging AI-assisted process</p></li><li><p>Design and deliver <strong>high-impact, persona-led demos</strong> for actuaries, underwriters, IT, and executive stakeholders, showing both the power of hx Renew and the art of the possible</p></li><li><p>Run technically ambitious <strong>POVs</strong>, often innovating at the edge of hx Renew’s capabilities to address complex or novel customer use cases</p></li><li><p>Act as a trusted technical advisor throughout the sales process, contributing meaningfully to RFPs and RFIs, answering deep technical questions, handling objections</p></li><li><p>Rapidly build deep expertise in <strong>hx Renew, Python-based workflows, insurance pricing and AI use cases</strong> becoming a credible technical authority with customers and internal teams</p></li><li><p>Feed real-world customer insight back into Product and Engineering, helping shape future platform capabilities based on emerging customer needs and emerging AI use cases</p></li></ul><h1><strong>What you’ll need to have done</strong></h1><ul><li><p><strong>You must have extensive experience coding in Python</strong></p></li><li><p>Exposure to <strong>technical, customer-facing work</strong> within a B2B SaaS, technology, or data-driven environment (this could include internships, placements, graduate roles, or early-career positions)</p></li><li><p>Some experience supporting or observing <strong>multi-stakeholder conversations</strong>, where technical considerations needed to be explained, justified, or adapted for different audiences</p></li><li><p>Demonstrated ability to <strong>build, adapt, or explain technical artefacts</strong> (e.g. demos, scripts, prototypes, analyses, workflows), even if not owned end-to-end in a sales context</p></li><li><p>Evidence of earning trust through <strong>clear communication, curiosity, and follow-through</strong>, whether with customers, internal stakeholders, or project partners</p></li><li><p>A strong sense of <strong>ownership and collaboration</strong>, with examples of working closely with peers across technical and non-technical functions to move work forward</p></li></ul><p><strong>Bonus:</strong></p><ul><li><p>Any exposure to insurance, fintech, or regulated industries</p></li><li><p>Curiosity about how <strong>pricing, risk, or decision-making</strong> drives value in complex domains</p></li></ul><h1><strong>You’re unlikely to thrive here if</strong></h1><ul><li><p>You prefer clearly defined problems over ambiguous, high-stakes challenges</p></li><li><p>You’re uncomfortable being customer-facing and highly visible in critical moments</p></li><li><p>You avoid accountability when outcomes are uncertain</p></li></ul><p>If reading our <a href=\"https://hx.wiki/\">Culture Document</a> leaves you feeling neutral rather than energised, hx may not be the place where you’ll do your best work. We’re building something that asks for commitment and conviction, and we want you to feel excited by the opportunity to grow with us.</p><h1><strong>Compensation</strong></h1><p>Base: $85,000 - $100,000</p><p>Bonus/Commission: $12,000 - $19,000</p><p>Total Compensation: up to $119,000 </p><p>Equity: We offer equity across all roles at hx, making it a significant component of total compensation. Your talent partner will be able to share more details about this.</p><h1>Additional perks</h1><p>Top-spec equipment (laptop, screens, adjustable desks, etc.).</p><p>Regular remote and in-person hackathons, lunch and learns, socials, and game nights.</p><p>Team breakfasts and lunches, snacks, drinks fridge, and a fun office at The Ministry.</p><p>Exceptional opportunities for personal development and growth as we build something remarkable together.</p><h1><strong>Interview process</strong></h1><ol><li><p>Talent Partner Interview </p></li><li><p>Take Home - Python Assessment </p></li><li><p>Hiring Manager Interview - with our Director of Solutions Engineering, <a href=\"https://www.linkedin.com/in/urszulaetheridge/\">Urszula Etheridge</a> </p></li><li><p>Code walk through and role play</p></li><li><p>Values Interview </p></li><li><p>Informal Coffee Chat - Meet our <a href=\"https://www.linkedin.com/in/tomonocle/\">Chief Solutions Officer, TC</a></p></li><li><p>We offer!</p></li></ol><h1><strong>Our commitment to Diversity</strong></h1><p>hxer's are at the centre of everything we build. We know that progress depends on diverse perspectives, and we are committed to creating an environment where everyone can thrive, grow, and make an impact. We recognise there is always more to do, and we take responsibility for shaping a workplace that is not only diverse but genuinely inclusive.</p><p>Diversity is not just the right thing to do, it is key to solving the complex challenges we choose to take on. By welcoming people from all backgrounds and experiences, we strengthen our ability to question assumptions, push boundaries, and design solutions that endure.</p><p>If you’re energised by complexity and motivated to grow, we encourage you to apply and join our global team.</p><h1><strong>Next steps</strong></h1><p>If this opportunity resonates with you, we encourage you to apply or share it with your connections! Our dedicated talent team reviews all applications, and we promise to provide feedback regardless of the outcome.</p><p>For more information about applying and to view other opportunities, you can visit our careers page.{{bonus=12000-18000}}</p><p>{{commission=20000}}</p><p>{{equity=5% - 10%}}</p><p><strong>Please note that background checks will be conducted as part of the hiring process to ensure compliance with our governance policies. We handle all background checks sensitively and in full compliance with relevant regulations. All applicant data will be processed in accordance with data protection regulations and our privacy policy.</strong></p></div></div>",
  "datePosted": "2026-01-23",
  "hiringOrganization": {
    "@type": "Organization",
    "name": "hyperexponential",
    "sameAs": "https://www.hyperexponential.com",
    "logo": "https://www.hyperexponential.com/logo.png"
  },
  "identifier": {
    "@type": "PropertyValue",
    "name": "hyperexponential",
    "value": "df3174eb-b238-4569-85d9-31d87b2ca0a1"
  },
  "employmentType": "FULL_TIME",
  "jobLocation": {
    "@type": "Place",
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "500 7th Avenue, 8th Floor",
      "addressLocality": "New York",
      "addressRegion": "NY",
      "postalCode": "10018",
      "addressCountry": "US"
    }
  },
  "baseSalary": {
    "@type": "MonetaryAmount",
    "currency": "USD",
    "value": {
      "@type": "QuantitativeValue",
      "minValue": 90000,
      "maxValue": 100000,
      "unitText": "YEAR"
    }
  },
  "directApply": true
}
